#config
#电力系统分析(韩祯祥 第三版) P407 例5.6
stru_config={'f':50,        #电机转子转动频率，Hz
            'Tj':8.18,      #电机惯性时间常数，s
            'D':10,         #阻尼系数
            'Pt':1,         #原动机功率标幺值
            'P2m':0.504,    #故障发生后发电机功率下降后的功率最大值的标幺值
            'P3m':1.35,     #故障切除后发动机功率上升后的功率最大值的标幺值
            'y0':34.53,     #故障前两个电机的初始功率差距角，°
            'h':0.000001,      #步长，每个计算周期的时间跨度，整体上越低结果约精确。s
            'tm':15}         #总计算时间，s


'''

#电力系统分析(韩祯祥 第三版) P407 例5.6
stru_config={'f':50,        #电机转子转动频率，Hz
            'Tj':8.18,      #电机惯性时间常数，s
            'Pt':1,         #原动机功率标幺值
            'P2m':0.504,    #故障发生后发电机功率下降后的功率最大值的标幺值
            'P3m':1.35,     #故障切除后发动机功率上升后的功率最大值的标幺值
            'y0':34.53,     #故障前两个电机的初始功率差距角，°
            'h':0.005,      #步长，每个计算周期的时间跨度，整体上越低结果约精确。s
            'tm':5}         #总计算时间，s
============================================================================
#电力系统分析(何仰赞) P201 例17.1
stru_config={'f':50,
            'Tj':11.28,
            'Pt':1,
            'P2m':0.52,
            'P3m':1.384,
            'y0':31.54,
            'h':0.005,
            'tm':2}
'''
